///////////////////////////////////////////////////////////////////////////////
//
// 作者：龙仕云  2014－3－18
//
// 事件
//
///////////////////////////////////////////////////////////////////////////////

module.exports = function(event, req, res, next){
	console.log(event);
  if (event.Event === 'subscribe') {
  	// 用户添加时候的消息
  	res.reply('谢谢添加字典公众账号，查生癖字，查字解释，字的祥细注解。应用尽用，新华字典有的都有。:)\n请输入一个字，将会得到相关描述。');
  } else if (event.Event === 'unsubscribe') {
  	res.reply('Bye! 谢谢你的关注下次再来。');
  } else {
  	res.reply('暂未支持! Coming soon!');
  }
};
